tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87j11_tdd.h
#define ECCP3AS                       1091
#define ECCP3AS_PSSBD0                1092
#define PSS3BD0                       1093
#define ECCP3AS_PSSBD                 1094
#define ECCP3AS_PSSBD1                1095
#define PSS3BD1                       1096
#define ECCP3AS_PSSAC0                1097
#define PSS3AC0                       1098
#define ECCP3AS_PSSAC                 1099
#define ECCP3AS_PSSAC1                1100
#define PSS3AC1                       1101
#define ECCP3AS_ECCPAS0               1102
#define ECCP3AS_ECCPAS                1103
#define ECCP3AS0                      1104
#define ECCP3AS_ECCPAS1               1105
#define ECCP3AS1                      1106
#define ECCP3AS_ECCPAS2               1107
#define ECCP3AS2                      1108
#define ECCP3AS_ECCPASE               1109
#define ECCP3ASE                      1110
#define ECCP2CON                      1111
#define CCP2M                         1112
#define CCP2M0                        1113
#define CCP2M1                        1114
#define CCP2M2                        1115
#define CCP2M3                        1116
#define DC2B                          1117
#define DC2B0                         1118
#define CCP2Y                         1119
#define DC2B1                         1120
#define CCP2X                         1121
#define P2M                           1122
#define P2M0                          1123
#define P2M1                          1124
#define ECCP2DEL                      1125
#define P2DC0                         1126
#define ECCP2DEL_PDC0                 1127
#define ECCP2DEL_PDC                  1128
#define P2DC1                         1129
#define ECCP2DEL_PDC1                 1130
#define P2DC2                         1131
#define ECCP2DEL_PDC2                 1132
#define P2DC3                         1133
#define ECCP2DEL_PDC3                 1134
#define P2DC4                         1135
#define ECCP2DEL_PDC4                 1136
#define P2DC5                         1137
#define ECCP2DEL_PDC5                 1138
#define P2DC6                         1139
#define ECCP2DEL_PDC6                 1140
#define ECCP2DEL_PRSEN                1141
#define P2RSEN                        1142
#define ECCP2AS                       1143
#define ECCP2AS_PSSBD                 1144
#define ECCP2AS_PSSBD0                1145
#define PSS2BD0                       1146
#define ECCP2AS_PSSBD1                1147
#define PSS2BD1                       1148
#define PSS2AC0                       1149
#define ECCP2AS_PSSAC0                1150
#define ECCP2AS_PSSAC                 1151
#define ECCP2AS_PSSAC1                1152
#define PSS2AC1                       1153
#define ECCP2AS_ECCPAS                1154
#define ECCP2AS0                      1155
#define ECCP2AS_ECCPAS0               1156
#define ECCP2AS1                      1157
#define ECCP2AS_ECCPAS1               1158
#define ECCP2AS2                      1159
#define ECCP2AS_ECCPAS2               1160
#define ECCP2AS_ECCPASE               1161
#define ECCP2ASE                      1162
#define ECCP1CON                      1163
#define CCP1M0                        1164
#define CCP1M                         1165
#define CCP1M1                        1166
#define CCP1M2                        1167
#define CCP1M3                        1168
#define CCP1Y                         1169
#define DC1B                          1170
#define DC1B0                         1171
#define CCP1X                         1172
#define DC1B1                         1173
#define P1M                           1174
#define P1M0                          1175
#define P1M1                          1176
#define ECCP1DEL                      1177
#define P1DC0                         1178
#define ECCP1DEL_PDC0                 1179
#define ECCP1DEL_PDC                  1180
#define P1DC1                         1181
#define ECCP1DEL_PDC1                 1182
#define P1DC2                         1183
#define ECCP1DEL_PDC2                 1184
#define P1DC3                         1185
#define ECCP1DEL_PDC3                 1186
#define P1DC4                         1187
#define ECCP1DEL_PDC4                 1188
#define P1DC5                         1189
#define ECCP1DEL_PDC5                 1190
#define P1DC6                         1191
#define ECCP1DEL_PDC6                 1192
#define P1RSEN                        1193
#define ECCP1DEL_PRSEN                1194
#define ECCP1AS                       1195
#define ECCP1AS_PSSBD                 1196
#define ECCP1AS_PSSBD0                1197
#define PSS1BD0                       1198
#define ECCP1AS_PSSBD1                1199
#define PSS1BD1                       1200
#define ECCP1AS_PSSAC0                1201
#define PSS1AC0                       1202
#define ECCP1AS_PSSAC                 1203
#define ECCP1AS_PSSAC1                1204
#define PSS1AC1                       1205
#define ECCP1AS_ECCPAS0               1206
#define ECCP1AS_ECCPAS                1207
#define ECCP1AS0                      1208
#define ECCP1AS_ECCPAS1               1209
#define ECCP1AS1                      1210
#define ECCP1AS_ECCPAS2               1211
#define ECCP1AS2                      1212
#define ECCP1ASE                      1213
#define ECCP1AS_ECCPASE               1214
#define WDTCON                        1215
#define SWDTEN                        1216
#define SWDTE                         1217
#define ADSHR                         1218
#define DEVCFG                        1219
#define LVDSTAT                       1220
#define REGSLP                        1221
#define ANCON0                        1222
#define PCFGL                         1223
#define PCFG0                         1224
#define PCFG1                         1225
#define PCFG2                         1226
#define PCFG3                         1227
#define PCFG4                         1228
#define PCFG5                         1229
#define PCFG6                         1230
#define PCFG7                         1231
#define ADCON1                        1232
#define ADCS0                         1233
#define ADCS                          1234
#define ADCS1                         1235
#define ADCS2                         1236
#define ACQT0                         1237
#define ACQT                          1238
#define CHSN3                         1239
#define ACQT1                         1240
#define VCFG01                        1241
#define ACQT2                         1242
#define VCFG11                        1243
#define ADCON1_ADCAL                  1244
#define ADFM                          1245
#define ANCON1                        1246
#define PCFGH                         1247
#define PCFG8                         1248
#define PCFG9                         1249
#define PCFG10                        1250
#define PCFG11                        1251
#define PCFG12                        1252
#define PCFG13                        1253
#define PCFG14                        1254
#define PCFG15                        1255
#define ADCON0                        1256
#define ADON                          1257
#define GO_nDONE                      1258
#define NOT_DONE                      1259
#define GODONE                        1260
#define GO_DONE                       1261
#define DONE                          1262
#define GO                            1263
#define GO_NOT_DONE                   1264
#define CHS                           1265
#define CHS0                          1266
#define CHS1                          1267
#define CHS2                          1268
#define CHS3                          1269
#define VCFG                          1270
#define VCFG0                         1271
#define VCFG1                         1272
#define ADCON0_ADCAL                  1273
#define SSP1CON2                      1274
#define SEN1                          1275
#define SSP1CON2_SEN                  1276
#define ADMSK11                       1277
#define SSP1CON2_RSEN                 1278
#define RSEN1                         1279
#define SSP1CON2_ADMSK1               1280
#define SSP1CON2_PEN                  1281
#define ADMSK21                       1282
#define PEN1                          1283
#define SSP1CON2_ADMSK2               1284
#define ADMSK31                       1285
#define RCEN1                         1286
#define SSP1CON2_RCEN                 1287
#define SSP1CON2_ADMSK3               1288
#define SSP1CON2_ACKEN                1289
#define ACKEN1                        1290
#define ADMSK41                       1291
#define SSP1CON2_ADMSK4               1292
#define ACKDT1                        1293
#define ADMSK51                       1294
#define SSP1CON2_ACKDT                1295
#define SSP1CON2_ADMSK5               1296
#define SSP1CON2_ACKSTAT              1297
#define ACKSTAT1                      1298
#define GCEN1                         1299
#define SSP1CON2_GCEN                 1300
#define SSP1CON1                      1301
#define SSP1CON1_SSPM0                1302
#define SSPM01                        1303
#define SSP1CON1_SSPM                 1304
#define SSP1CON1_SSPM1                1305
#define SSPM11                        1306
#define SSP1CON1_SSPM2                1307
#define SSPM21                        1308
#define SSPM31                        1309
#define SSP1CON1_SSPM3                1310
#define SSP1CON1_CKP                  1311
#define CKP1                          1312
#define SSPEN1                        1313
#define SSP1CON1_SSPEN                1314
#define SSPOV1                        1315
#define SSP1CON1_SSPOV                1316
#define WCOL1                         1317
#define SSP1CON1_WCOL                 1318
#define SSP1STAT                      1319
#define BF1                           1320
#define SSP1STAT_BF                   1321
#define UA1                           1322
#define SSP1STAT_UA                   1323
#define SSP1STAT_R_NOT_W              1324
#define RW1                           1325
#define NOT_W                         1326
#define SSP1STAT_R                    1327
#define SSP1STAT_nW                   1328
#define RW                            1329
#define SSP1STAT_READ_WRITE           1330
#define SSP1STAT_nWRITE               1331
#define SSP1STAT_I2C_READ             1332
#define SSP1STAT_R_W                  1333
#define SSP1STAT_NOT_WRITE            1334
#define SSP1STAT_R_nW                 1335
#define SSP1STAT_S                    1336
#define START                         1337
#define START1                        1338
#define SSP1STAT_I2C_START            1339
#define STOP                          1340
#define SSP1STAT_P                    1341
#define STOP1                         1342
#define SSP1STAT_I2C_STOP             1343
#define SSP1STAT_D                    1344
#define SSP1STAT_D_NOT_A              1345
#define NOT_A                         1346
#define SSP1STAT_D_A                  1347
#define SSP1STAT_D_nA                 1348
#define SSP1STAT_NOT_ADDRESS          1349
#define SSP1STAT_nA                   1350
#define DA1                           1351
#define DA                            1352
#define SSP1STAT_nADDRESS             1353
#define SSP1STAT_I2C_DAT              1354
#define SSP1STAT_DATA_ADDRESS         1355
#define SSP1STAT_CKE                  1356
#define CKE1                          1357
#define SSP1STAT_SMP                  1358
#define SMP1                          1359
#define SSP1ADD                       1360
#define SSP1ADD_MSK0                  1361
#define MSK01                         1362
#define SSP1ADD_MSK1                  1363
#define MSK11                         1364
#define SSP1ADD_MSK2                  1365
#define MSK21                         1366
#define MSK31                         1367
#define SSP1ADD_MSK3                  1368
#define SSP1ADD_MSK4                  1369
#define MSK41                         1370
#define MSK51                         1371
#define SSP1ADD_MSK5                  1372
#define SSP1ADD_MSK6                  1373
#define MSK61                         1374
#define SSP1ADD_MSK7                  1375
#define MSK71                         1376
#define SSP1MSK                       1377
#define SSP1MSK_MSK0                  1378
#define SSP1MSK_MSK1                  1379
#define SSP1MSK_MSK2                  1380
#define SSP1MSK_MSK3                  1381
#define SSP1MSK_MSK4                  1382
#define SSP1MSK_MSK5                  1383
#define SSP1MSK_MSK6                  1384
#define SSP1MSK_MSK7                  1385
#define T2CON                         1386
#define T2CKPS0                       1387
#define T2CKPS                        1388
#define T2CKPS1                       1389
#define TMR2ON                        1390
#define T2OUTPS0                      1391
#define TOUTPS                        1392
#define T2OUTPS1                      1393
#define T2OUTPS2                      1394
#define T2OUTPS3                      1395
#define MEMCON                        1396
#define WM                            1397
#define WM0                           1398
#define WM1                           1399
#define WAIT0                         1400
#define WAIT                          1401
#define WAIT1                         1402
#define EBDIS                         1403
#define EDBIS                         1404
#define PADCFG1                       1405
#define PMPTL                         1406
#define PMPTTL                        1407
#define ODCON3                        1408
#define SPI1OD                        1409
#define SPI2OD                        1410
#define T1CON                         1411
#define TMR1ON                        1412
#define TMR1CS                        1413
#define NOT_T1SYNC                    1414
#define T1SYNC                        1415
#define nT1SYNC                       1416
#define T1INSYNC                      1417
#define T1OSCEN                       1418
#define SOSCEN                        1419
#define T1CKPS0                       1420
#define T1CKPS                        1421
#define T1CKPS1                       1422
#define T1RUN                         1423
#define T1RD16                        1424
#define T1CON_RD16                    1425
#define ODCON2                        1426
#define USART1OD                      1427
#define U1OD                          1428
#define U2OD                          1429
#define USART2OD                      1430
#define ODCON1                        1431
#define ECCP1OD                       1432
#define ECCP2OD                       1433
#define ECCP3OD                       1434
#define CCP4OD                        1435
#define CCP5OD                        1436
#define RCON                          1437
#define BOR                           1438
#define NOT_BOR                       1439
#define nBOR                          1440
#define POR                           1441
#define nPOR                          1442
#define NOT_POR                       1443
#define PD                            1444
#define nPD                           1445
#define NOT_PD                        1446
#define nTO                           1447
#define TO                            1448
#define NOT_TO                        1449
#define nRI                           1450
#define NOT_RI                        1451
#define RI                            1452
#define NOT_CM                        1453
#define CM                            1454
#define nCM                           1455
#define IPEN                          1456
#define CM2CON1                       1457
#define CM2CON1_C1CH0                 1458
#define CM2CON1_CCH                   1459
#define CM2CON1_CCH0                  1460
#define CCH02                         1461
#define CM2CON1_C1CH1                 1462
#define CCH12                         1463
#define CM2CON1_CCH1                  1464
#define CM2CON1_CREF                  1465
#define CREF2                         1466
#define EVPOL02                       1467
#define CM2CON1_EVPOL0                1468
#define CM2CON1_EVPOL                 1469
#define CM2CON1_EVPOL1                1470
#define EVPOL12                       1471
#define CM2CON1_CPOL                  1472
#define CPOL2                         1473
#define COE2                          1474
#define CM2CON1_COE                   1475
#define CM2CON1_CON                   1476
#define CON2                          1477
#define CM1CON1                       1478
#define CM1CON1_CCH0                  1479
#define CM1CON1_CCH                   1480
#define CCH01                         1481
#define CM1CON1_C1CH0                 1482
#define CM1CON1_CCH1                  1483
#define CCH11                         1484
#define CM1CON1_C1CH1                 1485
#define CM1CON1_CREF                  1486
#define CREF1                         1487
#define EVPOL01                       1488
#define CM1CON1_EVPOL                 1489
#define CM1CON1_EVPOL0                1490
#define CM1CON1_EVPOL1                1491
#define EVPOL11                       1492
#define CM1CON1_CPOL                  1493
#define CPOL1                         1494
#define COE1                          1495
#define CM1CON1_COE                   1496
#define CM1CON1_CON                   1497
#define CON1                          1498
#define REFOCON                       1499
#define RODIV0                        1500
#define RODIV                         1501
#define RODIV1                        1502
#define RODIV2                        1503
#define RODIV3                        1504
#define ROSEL                         1505
#define ROSSLP                        1506
#define ROON                          1507
#define OSCCON                        1508
#define SCS0                          1509
#define SCS                           1510
#define SCS1                          1511
#define OSTS                          1512
#define IRCF                          1513
#define IRCF0                         1514
#define IRCF1                         1515
#define IRCF2                         1516
#define IDLEN                         1517
#define T0CON                         1518
#define T0PS                          1519
#define T0PS0                         1520
#define T0PS1                         1521
#define T0PS2                         1522
#define PSA                           1523
#define T0PS3                         1524
#define T0SE                          1525
#define T0CS                          1526
#define T08BIT                        1527
#define TMR0ON                        1528
#define STATUS                        1529
#define C                             1530
#define CARRY                         1531
#define DC                            1532
#define ZERO                          1533
#define Z                             1534
#define OV                            1535
#define OVERFLOW                      1536
#define N                             1537
#define NEGATIVE                      1538
#define INTCON3                       1539
#define INT1IF                        1540
#define INT1F                         1541
#define INT2IF                        1542
#define INT2F                         1543
#define INT3F                         1544
#define INT3IF                        1545
#define INT1E                         1546
#define INT1IE                        1547
#define INT2IE                        1548
#define INT2E                         1549
#define INT3E                         1550
#define INT3IE                        1551
#define INT1P                         1552
#define INT1IP                        1553
#define INT2IP                        1554
#define INT2P                         1555
#define INTCON2                       1556
#define RBIP                          1557
#define INT3IP                        1558
#define INT3P                         1559
#define TMR0IP                        1560
#define T0IP                          1561
#define INTEDG3                       1562
#define INTEDG2                       1563
#define INTEDG1                       1564
#define INTEDG0                       1565
#define RBPU                          1566
#define NOT_RBPU                      1567
#define nRBPU                         1568
#define INTCON                        1569
#define RBIF                          1570
#define INT0F                         1571
#define INT0IF                        1572
#define T0IF                          1573
#define TMR0IF                        1574
#define RBIE                          1575
#define INT0E                         1576
#define INT0IE                        1577
#define T0IE                          1578
#define TMR0IE                        1579
#define PEIE                          1580
#define PEIE_GIEL                     1581
#define GIEL                          1582
#define GIE_GIEH                      1583
#define GIE                           1584
#define GIEH                          1585
#define STKPTR0                       1586
#define STKPTR                        1587
#define SP0                           1588
#define STKPTR1                       1589
#define SP1                           1590
#define STKPTR2                       1591
#define SP2                           1592
#define SP3                           1593
#define STKPTR3                       1594
#define STKPTR4                       1595
#define SP4                           1596
#define STKUNF                        1597
#define STKOVF                        1598
#define STKFUL                        1599

#endif // _PIC18F87J11_H_
